# running in /home/zhulf/project/xiangshan/SymbiMC/benchmark/coverTasks/cover_1/model/
read_rtlil design_prep.il
delete */t:$print
hierarchy -simcheck
formalff -assume
flatten
setundef -undriven -anyseq
setattr -unset keep
delete -output
opt -full
techmap
opt -fast
memory_map -formal
formalff -clk2ff -ff2anyinit
simplemap
dffunmap
abc -g AND -fast
opt_clean
stat
write_aiger -I -B -zinit -no-startoffset -map design_aiger.aim -ywmap design_aiger.ywa design_aiger.aig
