# running in /home/zhulf/project/xiangshan/SymbiMC/benchmark/coverTasks/cover_1/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
